{
    "intents":[
        {
            "tag": "greetings",
            "patterns": [
                "Привіт",
                "Як ся маєш?",
                "Як справи?",
                "Добрий день!",
                "Вітаю!"
            ],
            "responses": [
                "Привіт і тобі",
                "Привіт! Гарний день, чи не так?",
                "Кукусікі!",
                "Радий тебе бачити (читати)!"
            ]
        },
	    {
            "tag": "question",
            "patterns": [
                "Що ти вмієш?",
                "Що ти знаєш?",
                "Для чого тебе створили?",
                "Нащо ти потрібен?",
                "На які питання ти можеш відповісти?"
            ],
            "responses": [
                "Я навчальний чат-бот, спеціально навчений давати відповіді на поставлені питання. Щоправда, я не був відмінником в школі, знаю не так багато, але можу дати відповідь на деякі питання з {format_on} фізики, математики, лінгвістики, географії. {format_off} А також умію проводити деякі види {format_on} роботи з текстом, відповідати на загальні питання.{format_off} Також можу ознайомити вас з деякими іншими розробками мого творця - ти тільки запитай:)"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Дякую за відповідь!",
                "Дякую тобі!",
                "Те що треба! Дякую",
                "А ти розумний! Дякую",
                "Дякую, друже!"
            ],
            "responses": [
                "Звертайся!",
                "Нема за що! Може, маєш ще питання?",
                "Незки:3 Маєш ще питання?",
                "Будь ласка! Хочеш ще отримати відповідь на якесь питання?"
            ]
        },
        {
            "tag": "bye",
            "patterns": [
                "Бувай!",
                "На все добре!",
                "Ну, я піду. Пока",
                "Гарно поговорили, бувай!",
                "Бувай, друже!"
            ],
            "responses": [
                "Бувай!",
                "До зустрічі!",
                "Бай-бай)",
                "На все добре! Звертайся, якщо що."
            ]
        },
        {
            "tag": "physics",
            "patterns": [
                "Можеш допомогти з фізикою?",
                "О, розкажи щось з фізики",
                "Мені потрібна допомога з фізики",
                "Допоможи, будь ласка, з фізикою",
                "Фізика"
            ],
            "responses": [
                "Бачу, ти хочеш почути щось про фізику. Знаєш, я погано фізику в школі вивчав. Запам’ятав лише одну тему – {format_on}сталу Планка{format_off} – можу тобі про неї розповісти."
            ]
        },
        {
            "tag": "physics/planck constant",
            "patterns": [
                "Розкажи про сталу Планка",
                "Що таке стала Планка?",
                "Стала Планка",
                "Цікаво почути про константу Планка"
            ],
            "responses": [
                "Стала Планка — елементарний квант дії, фундаментальна фізична величина, яка відображає квантову природу Всесвіту. Загальний момент імпульсу фізичної системи може змінюватись лише кратно величині сталої Планка. Як наслідок у квантовій механіці фізичні величини виражаються через сталу Планка.\n Стала Планка позначається латинською літерою h. Вона має розмірність енергії, помноженої на час\nh = 6.62607015х10−34 Дж/с"
            ]
        },
        {
            "tag": "mathematics",
            "patterns": [
                "Можеш допомогти з математикою?",
                "О, розкажи щось з математики",
                "Мені потрібна допомога з математикою",
                "Допоможи, будь ласка, з математикою",
                "Математика"
            ],
            "responses": [
                "Бачу, ти хочеш почути щось про математику. Я непогано знаю математику! (я ж все-таки робот). Можу вирішувати кілька видів задач: {format_on}шукати відстань між двома точками в просторі, обчислювати площу трикутника{format_off} (це моя улюблена тема, знаю кілька способів – запитай про це і дізнаєшся). А також я здатен {format_on}назвати число пі з точністю до 15 знаків після коми{format_off}, якщо цікаво, можу і це показати."
            ]
        },
        {
            "tag": "mathematics/distance between two points",
            "patterns": [
                "Відстань між двома точками",
                "Порахуй тоді відстань між точками",
                "Знайди відстань між точками, будь ласка",
                "Допоможи, будь ласка, знайти відстань між двома точками",
                "Які способи ти знаєш для обчислення площі трикутника?",
                "Як ти вмієш обчислювати площу трикутника?"
            ],
            "responses": [
                "Окей, це я можу. Скажи мені чітко {format_on}координати двох точок у просторі,{format_off} щоб я зрозумів, що саме рахувати (дробові числа пиши через крапку, розділяй координати, наприклад, крапкою з комою)."
            ]
        },
        {
            "tag": "mathematics/triangle's area",
            "patterns": [
                "Площа трикутника",
                "Обчисли площу трикутника",
                "Знайди площу трикутника, будь ласка",
                "Допоможи, будь ласка, знайти площу трикутника",
                "Відстань у просторі",
                "Відстань на площині"
            ],
            "responses": [
                "Окей, якщо ти хочеш, щоб я порахував площу трикутника, давай розберемося, як саме. Можеш мені вказати {format_on}довжину однієї сторони трикутника та довжину висоти, що на неї опущена{format_off}. Або, якщо ти такий розумний, можеш вказати {format_on}дві сторони трикутника у форматі векторів{format_off}, і я все порахую через їхній добуток (я лінійну алгебру не прогулював, знаєш). То що обереш? (1 чи 2)"
            ]
        },
        {
            "tag": "mathematics/pi number",
            "patterns": [
                "Число пі",
                "Хочу почути число пі",
                "Ну то давай, похвастайся знанням числа пі",
                "Скажи точне значення числа пі",
                "π",
                "Скажи точне значення π"
            ],
            "responses": [
                "Число пі  — математична константа, що визначається в Евклідовій геометрії як відношення довжини кола до його діаметра або як площа круга одиничного радіуса. Приблизно дорівнює {format_on}3.141592653589793{format_off}."
            ]
        },
        {
            "tag": "geography",
            "patterns": [
                "Можеш допомогти з географією?",
                "О, розкажи щось з географії",
                "Мені потрібна допомога з географією",
                "Допоможи, будь ласка, з географією",
                "Географія"
            ],
            "responses": [
                "Бачу, ти хочеш почути щось про географію. Я знаю кілька цікавих фактів, якими можу поділитися:) Може, ти хочеш дізнатися, яке {format_on}найбільше озеро у світі за площею{format_off}? Або про те, {format_on}які дві держави мають найбільшу кількість кордонів з іншими державами{format_off}? І звісно ж, всі знають, де лежить пустеля Сахара, але чи знаєш ти {format_on}в якій країні лежить друга пустеля після Сахари за площею{format_off}? Обирай своє питання і я радо відповім!)"
            ]
        },
        {
            "tag": "geography/largest lake",
            "patterns": [
                "Цікаво, що за найбільше озеро у світі",
                "Яке озеро найбільше за площею?",
                "Де знаходиться найбільше озеро в світі?",
                "Найбільше озеро у світі за площею",
                "Географія"
            ],
            "responses": [
                "Може прозвучати несподівано, але найбільше озеро світу за площею - це {format_on}Каспійське море{format_off}. очніше, це найбільша безстічна і замкнута водойма за площею, яка становить 390 тисяч квадратних кілометрів. А обсяг водойми досягає 78 тис. кілометрів кубічних, що перевищує 44% води всіх озер світу.\n\nРозташований Каспій на стику Європи та Азії. Його води омивають береги п'яти держав: Ірану, Казахстану, РФ, Туркменії та Азербайджану. У Каспійське море впадають 130 річок, найбільші з яких: Самур, Волга, Урал, Терек, Кура, Атрек."
            ]
        },
        {
            "tag": "geography/most borders",
            "patterns": [
                "Цікаво, які держави мають найбільше кордонів",
                "Які країни мають найбільше кордонів?",
                "У яких країн найбільше кордонів з іншими державами?",
                "У кого найбільше кордонів з іншими країнами у світі?",
                "Дві країни, що мають найбільше кордонів з іншими державами"
            ],
            "responses": [
                "Країни, що мають найбільшу кількість державних кордонів: {format_on}Китай та Росія{format_off}.\nРосія, будучи також найбільшою державою у світі за площею, має загальну довжину державного кордону протяжністю в 20,241 км та межує з 14 іншими державами: Північною Кореєю, Китаєм, Монголією, Казахстаном, Азербайджаном, Грузією, Україною, Білоруссю, Польщою, Литвою, Латвією, Естонією, Фінляндією, Норвегією.\nКитайська Народна Республіка, друга держава у світі за площею, маючи загальну довжину державного кордону протяжністю в 22,117 км, межує також з 14 іншими державами: Росією, Монголією, Казахстаном, Киргизстаном, Таджикістаном, Афганістаном, Пакістаном, Індією, Непалом, Бутаном, М'янмою, Лаосом, В'єтнамом, Північною Кореєю."
            ]
        },
        {
            "tag": "geography/second largest desert",
            "patterns": [
                "Цікаво, пустеля найбільша після Сахари?",
                "Яка пустеля друга за площею у світі?",
                "У якій країні знаходиться друга найбільша пустеля?",
                "У якій країні лежить друга після Сахари пустеля?",
                "Країна, у якій знаходить друга після Сахари пустеля за площею у світі"
            ],
            "responses": [
                "Пустелі Австралії (включаючи Велику пустелю Вікторія) об'єднуються як {format_on}Австралійська пустеля{format_off}. Це четверта за величиною пустеля в світі (Після Антарктичної, Арктичної та пустелі Сахара). Пустелі займають приблизно 18% суші Австралійського материка."
            ]
        },
        {
            "tag": "linguistics",
            "patterns": [
                "Можеш розказати щось цікаве з лінгвістики?",
                "О, розкажи щось з лінвгістики",
                "Мені потрібна допомога з лінгвістикою",
                "Допоможи, будь ласка, з лінгвістикою",
                "Лінгвістика"
            ],
            "responses": [
                "Бачу, ти хочеш почути щось про лінгвістику. Я дещо обізнаний у цій сфери, можу поділитися\n інформацією на кілька тем:) Може, нагадати тобі, {format_on}як утворюється за правилами граматики\n англійської мови Passive Voice в Present Simple Tense{format_off}? Або сформулювати {format_on}правила\n відмінювання іменників в давальному відмінку української мови{format_off}? Став своє запитання, і я радо відповім)"
            ]
        },
        {
            "tag": "linguistics/passive voice",
            "patterns": [
                "Розкажи про англійську граматику",
                "Розкажи, як утворити пасивний стан в теперішньому часі",
                "Нагадай, як утворюється passive voice в present simple",
                "Сформулюй, будь ласка, правила утворення passive voice (пасивного стану) в present simple tense (теперішньому простому часі) за правилами граматики англійської мови",
                "Як утворити Passive Voice в Present Simple?"
            ],
            "responses": [
                "В англійській мові існує два граматичні стани дієслова: активний (Active Voice) та пасивний (Passive Voice). Активний стан присудка вживається разом з підметом, що є особою чи предметом, які виконують дію, а у пасивному стані дія спрямована на особу або предмет, виражену підметом.\nНаприклад: {format_on}He cooks dinner{format_off}. – Він готує вечерю (активний стан). \n{format_on}The dinner is cooked{format_off}. – Вечерю готують (пасивний стан). \nЯк бачимо, пасивний стан у простому теперішньому часі (Present Simple) утворюється {format_on}за допомогою дієслова to be + III форма основного дієслова{format_off}."
            ]
        },
        {
            "tag": "linguistics/dative case",
            "patterns": [
                "Розкажи про давальний відмінок української мови",
                "Розкажи, як утворити давальний відмінок іменника",
                "Нагадай, як утворюється давальний відмінок у іменників українсьої мови",
                "Сформулюй, будь ласка, правила утворення давального відмінка для іменників в українській мові",
                "Як утворюються іменники в давальному відмінку?"
            ],
            "responses": [
                "Давальний відмінок вживається (найчастіше) для позначення особи, до якої направлена певна дія:\n{format_on}Він дарує квіти своїй сестрі{format_off}. – Кому він дарує квіти? Чиїй сестрі він дарує квіти?\nІменники в давальному відмінку набувають різних закінчень в залежності від роду та числа:\n1) Чоловічий рід: {format_on}-ові/-еві/єві{format_off} (у множині {format_on}-ам/-ям{format_off})\n2) Жіночий рід: {format_on}-і/-ії{format_off} (у множині {format_on}-ам/-ям{format_off})\n3) Середній рід: {format_on}-у/-ю{format_off} (у множині {format_on}-ам/-ям{format_off})\nІснує дуже багато деталей і тонкощів щодо відмінювання та використання давального відмінка, для більш докладного ознайомлення рекомендую перейти на сторінку: {format_on}https://webpen.com.ua/pages/linguistic_norm/dative_case.html{format_off}"
            ]
        },
        {
            "tag": "work with text",
            "patterns": [
                "Можеш допомогти з опрацюванням тексту?",
                "О, давай проведемо роботу з текстом",
                "Мені потрібна допомога з аналізом та опрацюванням тексту",
                "Допоможи, будь ласка, з роботою з текстом",
                "Робота з текстом"
            ],
            "responses": [
                "Бачу, ти хочеш, щоб я виконав якийсь вид роботи з текстом. Ти звернувся за адресою, адже\nце однозначно моя сильна сторона!) Я можу допомогти тобі виконати такі прикладні задачі: \n{format_on}знаходити складені з латинських літер слова, які у твоєму\n заданому тексті трапляються\n більше 10 разів{format_off}, {format_on}знаходити всі слова, які складаються з цифр{format_off}, {format_on}виводити\nтекст без зайвих пробілів{format_off} (видалити подвійні пробіли, пробіли в початку\n та в кінці рядка), {format_on}знаходити найдовше речення в тексті{format_off}, {format_on}знаходити найбільш часто вживану літеру в тексті{format_off}.\nДля цього обери спочатку, яке саме завдання ти хочеш, щоб я виконав)"
            ]
        },
        {
            "tag": "work with text/search number words",
            "patterns": [
                "Допоможи знайти написані цифрами слова в тексті",
                "Знайди всі числа в тексті, слова написані цифрами",
                "Знайди в тексті слова, що складаються з цифр, чисел",
                "Пошукай слова, написані цифрами",
                "Знайти всі слова, які складаються з цифр."
            ],
            "responses": [
                "Гаразд, я можу це зробити. {format_on}Скинь мені свій текст{format_off}, і я виведу тобі всі слова, що в ньому складаються лише з цифр (якщо такі знайдуться, звісно)."
            ]
        },
        {
            "tag": "work with text/search latin script words",
            "patterns": [
                "Допоможи знайти написані латиницею слова в тексті",
                "Знайди 10 латинських слів у тексті",
                "Знайди в тексті 10 слів, написаних латинськими літерами",
                "Пошукай слова, написані латинськими буквами",
                "Знайти складені з латинських літер слова, які у тексті зустрічаються більше 10 разів."
            ],
            "responses": [
                "Гаразд, я можу це зробити. {format_on}Скинь мені свій текст{format_off}, і я виведу тобі 10 слів, що написані в ньому латинськими літерами (якщо стільки знайдеться, звісно)."
            ]
        },
        {
            "tag": "work with text/delete extra spaces",
            "patterns": [
                "Допоможи видалити зайві пробіли в тексті",
                "Знайди зайві пробіли та відступи у тексті та прибери їх",
                "Знайди в тексті подвійні пробіли",
                "Пошукай зайві пробіли й відступи, видали їх",
                "Вивести текст без зайвих пробілів (видалити подвійні пробіли, пробіли в початку та в кінці рядка)."
            ],
            "responses": [
                "Гаразд, я можу це зробити. {format_on}Скинь мені свій текст{format_off}, і я поверну тобі його без зайвих пробілів."
            ]
        },
        {
            "tag": "work with text/longest sentence",
            "patterns": [
                "Допоможи знайти найдовше речення в тексті",
                "Знайди найдовше речення в тексті",
                "Знайди в тексті найбільш довге речення",
                "Пошукай, яке речення в тексті найдовше",
                "Знайти найдовше речення в тексті."
            ],
            "responses": [
                "Гаразд, я можу це зробити. {format_on}Скинь мені свій текст{format_off}, і я поверну тобі найдовше речення в ньому."
            ]
        },
        {
            "tag": "work with text/most frequent letter",
            "patterns": [
                "Допоможи знайти літеру, що вживається найчастіше",
                "Яка літера в тексті використана найбільшу кількість разів?",
                "Знайди в тексті найбільш частовживану букву",
                "Пошукай, яка літера в тексті використана найчастіше",
                "Знайти найбільш часто вживану літеру в тексті."
            ],
            "responses": [
                "Гаразд, я можу це зробити. {format_on}Скинь мені свій текст{format_off}, і я поверну тобі найбільш частовживану літеру в ньому."
            ]
        },
        {
            "tag": "miscellaneous",
            "patterns": [
                "Давай поговоримо на загальні теми",
                "Що ти можеш розказати із загальних питань?",
                "Які загальні запитання я можу тобі поставити?",
                "Якого роду загальні питання?",
                "Загальне"
            ],
            "responses": [
                "Бачу, ти хочеш, щоб я відповів на якісь загальні питання. Я можу тобі дуже точно назвати,\n {format_on}який зараз рік та місяць{format_off}, якщо ти раптом забув (або прилетів з майбутнього). А також я\nможу запропонувати {format_on}пограти в одну гру, яка називається «історія»{format_off}! Запитай у мене про це,\nі я розкажу правила)"
            ]
        },
        {
            "tag": "miscellaneous/year and month",
            "patterns": [
                "Який нині рік та місяць?",
                "Як щодо поточного року та місяця?",
                "Який там зараз рік?",
                "Який там зараз місяць?",
                "Який зараз рік? Який зараз місяць?"
            ],
            "responses": [
                "Ага, питаєш про поточну дату. Дай я зараз уточню в календарику..."
            ]
        },
        {
            "tag": "miscellaneous/story",
            "patterns": [
                "Розкажи правила гри",
                "Давай пограємо в історію",
                "Які правила гри \"історія\"?",
                "Що за гра?",
                "Цікаво, що за гра про історію. Розкажи детальніше.",
                "Гра «історія»."
            ],
            "responses": [
                "Скажи мені, хто буде головним героєм історії та їх стать, і я складу рандомну історію з цим іменем)"
            ]
        },
        {
            "tag": "other projects",
            "patterns": [
                "Розкажи про інші розробки",
                "Що за інші розробки, проєкти?",
                "Які інші розробки твого творця ти можеш показати?",
                "Які ще проєкти та розробки були у твого розробника?",
                "Інші розробки"
            ],
            "responses": [
                "Бачу, ти хочеш, щоб я показав тобі інші проєкти мого розробника. Обирай, що саме тебе\nзацікавить: {format_on}конвертер валют{format_off}, {format_on}сегментатор дієслів української мови{format_off}, {format_on}японська азартна гра\nчо-хан{format_off}, {format_on}підрахунок орлів та решок під час підкидання монети{format_off}, {format_on}корпус пісень Тейлор Свіфт{format_off}."
            ]
        },
        {
            "tag": "other projects/currency",
            "patterns": [
                "Покажи конвертер валют",
                "Ти вмієш конвертувати валюти?",
                "Ти можеш порахувати обмін валют за курсом?",
                "Тебе можна використати як обмінник валют?",
                "Конвертер валют."
            ],
            "responses": [
                "Так, я можу допомогти тобі сконвертувати валюти. Перенаправляю тебе на програму обмінника валют."
            ]
        },
        {
            "tag": "other projects/verb segmentator",
            "patterns": [
                "Ти вмієш виділяти закінчення в дієсловах?",
                "Ти вмієш сегментувати дієслова?",
                "Ти можеш виділити закінчення в дієслові?",
                "Ти знаєш як ділити дієлсова на морфеми?",
                "Сегментатор дієслів української мови."
            ],
            "responses": [
                "Так, я можу допомогти тобі виділити закічення в дієсловах (та деякі суфікси). Перенаправляю тебе на програму сегментатора дієслів."
            ]
        },
        {
            "tag": "other projects/taylor swift",
            "patterns": [
                "Ти знаєш всі пісні Тейлор Свіфт?",
                "Що ти можеш робити з корпусом пісень?",
                "Ти можеш шукати слова в піснях Тейлор Свіфт?",
                "Що за корпус Тейлор Свіфт?",
                "Корпус пісень Тейлор Свіфт"
            ],
            "responses": [
                "Корпус пісень допоможе тобі знайти усі рядки з усіх пісень Тейлор Свіфт, де використовується певне, задане тобою слово (а також ти побачиш кількість його слововживань за кожним альбомом окремо). Перенаправляю тебе на програму корпусу пісень Тейлор Свіфт."
            ]
        },
        {
            "tag": "other projects/cho-han",
            "patterns": [
                "Що за японська азартна гра?",
                "Розкажи про гру чо-хан",
                "Покажи цю азартну гру чо-хан",
                "Цікаво, що це за японська азартна гра",
                "Японська азартна гра чо-хан"
            ],
            "responses": [
                "Перенаправляю тебе на програму з грою чо-хан (на жаль, вона поки не локазізована українською)."
            ]
        },
        {
            "tag": "other projects/coin",
            "patterns": [
                "Давай рахувати підкидання монети",
                "Покажи програму підрахунку орлів та решок",
                "Цікаво, скільки разів випаде орел або решка",
                "Хочу підрахувати статистику підкидання монети",
                "Підрахунок орлів та решок під час підкидання монети"
            ],
            "responses": [
                "Перенаправляю тебе на програму, яка може рахувати кількість випадіння орла або решки за вказаною кількістю підкидань."
            ]
        }
    ]
}
            