import re
def VerbSegmentator():
     current = input('Введіть дієслівну словоформу:')
     past = r'л((а)$|(о)$|(и)$)'
     future = r'тим((у)$|(еш)$|(ете)$|(емо)$|(е)$|(еть)$|(уть)$)'
     flexion = r'((тиму)$|(тимеш)$|(тимете)$|(тимемо)$|(тиме)$|(тиметь)$|(тимуть)$|(ать)$|(ять)$|(уть)$|(ють)$|(ить)$|(їть)$|(іть)$|(емо)$|(ємо)$|(имо)$|(імо)$|(ьмо)$|(ймо)$|(мо)$|(ете)$|(еть)$|(єте)$|(ите)$|(ьте)$|(іте)$|(йте)$|(ти)$|(те)$|(еш)$|(єш)$|(иш)$|(їш)$|(ла)$|(ло)$|(ли)$|(у)$|(ю)$|(е)$|(є)$|(в)$|(й)$|(и)$|(ь)$)'
     if current.endswith(('ся', 'сь')):
          current, postfix = current[0:-2], current[-2:]
          x = re.sub(flexion, '-\\1', current)
          x = re.sub(past, 'л-\\1', x)
          x = re.sub(future, 'ти-м-\\1', x)
          print(x+'-'+postfix)
     else:
          x = re.sub(flexion, '-\\1', current)
          x = re.sub(past, 'л-\\1', x)
          x = re.sub(future, 'ти-м-\\1', x)
          print(x)